

<!DOCTYPE html>
<html lang="zh-CN">
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content>
    <title>I Wanted To Say | 个人博客</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x5404;&amp;#x4F4D;&amp;#x9886;&amp;#x5BFC;&amp;#x597D;&amp;#xFF1A;    &amp;#x6211;&amp;#x53EB;&amp;#x5218;&amp;#x771F;&amp;#x5EF6;&amp;#xFF0C;&amp;#x4E8E;2017&amp;#x5E74;9&amp;#x6708;11&amp;#x65E5;&amp;#x6210;&amp;#x4E3A;&amp;#x54B1;&amp;#x4EEC;&amp;#x516C;&amp;#x53F8;&amp;#x5C45;&amp;#x5B">
<meta property="og:type" content="article">
<meta property="og:title" content="I Wanted To Say">
<meta property="og:url" content="http://yoursite.com/2019/03/12/myhome/index.html">
<meta property="og:site_name" content="个人博客">
<meta property="og:description" content="&amp;#x5404;&amp;#x4F4D;&amp;#x9886;&amp;#x5BFC;&amp;#x597D;&amp;#xFF1A;    &amp;#x6211;&amp;#x53EB;&amp;#x5218;&amp;#x771F;&amp;#x5EF6;&amp;#xFF0C;&amp;#x4E8E;2017&amp;#x5E74;9&amp;#x6708;11&amp;#x65E5;&amp;#x6210;&amp;#x4E3A;&amp;#x54B1;&amp;#x4EEC;&amp;#x516C;&amp;#x53F8;&amp;#x5C45;&amp;#x5B">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-03-12T07:29:02.413Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="I Wanted To Say">
<meta name="twitter:description" content="&amp;#x5404;&amp;#x4F4D;&amp;#x9886;&amp;#x5BFC;&amp;#x597D;&amp;#xFF1A;    &amp;#x6211;&amp;#x53EB;&amp;#x5218;&amp;#x771F;&amp;#x5EF6;&amp;#xFF0C;&amp;#x4E8E;2017&amp;#x5E74;9&amp;#x6708;11&amp;#x65E5;&amp;#x6210;&amp;#x4E3A;&amp;#x54B1;&amp;#x4EEC;&amp;#x516C;&amp;#x53F8;&amp;#x5C45;&amp;#x5B">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "刘真延",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>个人博客</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">刘真延</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item">
        <i class="home icon"></i>
        首页
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-myhome" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    I Wanted To Say
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#x5404;&#x4F4D;&#x9886;&#x5BFC;&#x597D;&#xFF1A;<br>    &#x6211;&#x53EB;&#x5218;&#x771F;&#x5EF6;&#xFF0C;&#x4E8E;2017&#x5E74;9&#x6708;11&#x65E5;&#x6210;&#x4E3A;&#x54B1;&#x4EEC;&#x516C;&#x53F8;&#x5C45;&#x5BB6;&#x751F;&#x6D3B;&#x4E8B;&#x4E1A;&#x90E8;&#x7684;&#x4E00;&#x540D;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x5DF2;&#x6765;&#x5230;&#x516C;&#x53F8;&#x5FEB;&#x4E09;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x672C;&#x4EBA;&#x4E0E;&#x540C;&#x4E8B;&#x76F8;&#x5904;&#x878D;&#x6D3D;&#xFF0C;&#x5C0A;&#x656C;&#x5404;&#x4E2A;&#x9886;&#x5BFC;&#x3002;&#x5728;&#x8FD9;&#x8FD1;&#x4E09;&#x4E2A;&#x6708;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x63A5;&#x89E6;&#x4E86;&#x4E0D;&#x5C11;&#x4EBA;&#x548C;&#x4E8B;&#xFF0C;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4E5F;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x5C1A;&#x6709;&#x8BB8;&#x591A;&#x7F3A;&#x70B9;&#x9700;&#x8981;&#x6539;&#x6B63;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x5BF9;&#x6211;&#x5DE5;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x505A;&#x5982;&#x4E0B;&#x6C47;&#x62A5;&#xFF1A;<br>    &#x4E00;&#x3001;&#x5BF9;&#x6240;&#x8D1F;&#x8D23;&#x7684;&#x5C97;&#x4F4D;&#x7684;&#x719F;&#x6089;<br>    &#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x5C45;&#x5BB6;&#x751F;&#x6D3B;&#x4E8B;&#x4E1A;&#x90E8;&#x7684;&#x524D;&#x7AEF;&#x4E1A;&#x52A1;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x538B;&#x529B;&#x6709;&#x70B9;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#x5927;&#x516C;&#x53F8;&#x5BF9;&#x6280;&#x672F;&#x8981;&#x6C42;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x5BF9;&#x4E2A;&#x4EBA;&#x7684;&#x6574;&#x4F53;&#x7D20;&#x8D28;&#x8981;&#x6C42;&#x4E5F;&#x9AD8;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ECE;&#x5C0F;&#x516C;&#x53F8;&#x51FA;&#x6765;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x5168;&#x65B0;&#x7684;&#x63A5;&#x89E6;&#x548C;&#x8BA4;&#x77E5;&#xFF0C;&#x8FD9;&#x671F;&#x95F4;&#x7279;&#x522B;&#x611F;&#x8C22;&#x6211;&#x4EEC;&#x7EC4;&#x7684;&#x6BCF;&#x4F4D;&#x540C;&#x4E8B;&#x5BF9;&#x6211;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x8BA9;&#x6211;&#x5C3D;&#x5FEB;&#x878D;&#x5165;&#x96C6;&#x4F53;&#xFF0C;&#x5C3D;&#x65E9;&#x8BA4;&#x77E5;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x8D23;&#x3002;<br>    &#x4E8C;&#x3001;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x53CA;&#x6210;&#x7EE9;<br>        &#x6765;&#x5230;&#x516C;&#x53F8;&#x63A5;&#x624B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x9884;&#x7EA6;&#x6302;&#x53F7;&#x9879;&#x76EE;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x9700;&#x8981;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x7528; react + webpack &#x72EC;&#x7ACB;&#x5B8C;&#x6210;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x624B;&#x65F6;&#x538B;&#x529B;&#x633A;&#x5927;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x9879;&#x76EE;&#x5468;&#x671F;&#x6BD4;&#x8F83;&#x77ED;&#xFF0C;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x5C31;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x800C;&#x4E14;&#x53C8;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x5B8C;&#x6210;&#xFF0C;&#x5FC3;&#x91CC;&#x6709;&#x70B9;&#x6CA1;&#x5E95;&#x3002;&#x4E0D;&#x8FC7;&#x968F;&#x7740;&#x5F00;&#x53D1;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x4E00;&#x5207;&#x8FD8;&#x7B97;&#x987A;&#x5229;&#xFF0C;&#x5F53;&#x7136;&#x4E2D;&#x95F4;&#x4E0D;&#x514D;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x96BE;&#x89E3;&#x7684;&#x95EE;&#x9898;&#x548C;bug&#xFF0C;&#x6211;&#x90FD;&#x8010;&#x5FC3;&#x7684;&#x9010;&#x6761;&#x89E3;&#x51B3;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x4E5F;&#x5728;&#x540C;&#x4E8B;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x89E3;&#x51B3;&#x6389;&#x4E86;&#xFF0C;&#x6700;&#x540E;&#x5B8C;&#x6210;&#x4E86;&#x9879;&#x76EE;&#x4E2D;&#x6240;&#x6709;&#x529F;&#x80FD;&#x548C;&#x52A8;&#x6001;&#x4EA4;&#x4E92;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x987A;&#x5229;&#x4E0A;&#x7EBF;&#x3002;<br>        PC&#x7AEF;&#x7684;&#x827A;&#x672F;&#x54C1;&#x9879;&#x76EE;&#x662F;&#x6211;&#x63A5;&#x624B;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x6211;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x7684;&#x662F;&#x5546;&#x5BB6;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x9875;&#x9762;&#xFF0C;&#x827A;&#x672F;&#x54C1;&#x8BBE;&#x7F6E;&#x9875;&#x9762;&#x7684;&#x7535;&#x8111;&#x7248;&#x548C;&#x624B;&#x673A;&#x7248;&#xFF0C;&#x8FD0;&#x8425;&#x7AEF;&#x4E0A;&#x4F20;&#x80CC;&#x666F;&#x56FE;&#x7684;&#x7535;&#x8111;&#x7248;&#x548C;&#x624B;&#x673A;&#x7248;&#x7B49;&#x6240;&#x6709;&#x9875;&#x9762;&#x7684;&#x9759;&#x6001;&#x5F00;&#x53D1;&#x548C;&#x52A8;&#x6001;&#x4EA4;&#x4E92;&#x529F;&#x80FD;&#x7684;&#x5B8C;&#x6210;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x6574;&#x4F53;&#x4E5F;&#x6BD4;&#x8F83;&#x987A;&#x5229;&#xFF0C;&#x5C31;&#x662F;&#x4E2D;&#x95F4;&#x4EA7;&#x54C1;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x9700;&#x6C42;&#x548C;&#x6539;&#x52A8;&#xFF0C;&#x62D6;&#x5EF6;&#x4E86;&#x51E0;&#x5929;&#xFF0C;&#x76EE;&#x524D;&#x4E5F;&#x5DF2;&#x7ECF;&#x63A5;&#x8FD1;&#x5C3E;&#x58F0;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x8981;&#x548C;&#x540E;&#x7AEF;&#x5BF9;&#x9875;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x6D4B;&#x4E0A;&#x7EBF;&#x3002;<br>        &#x76F4;&#x901A;&#x540D;&#x533B;&#x5C06;&#x662F;&#x6211;&#x63A5;&#x624B;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x9884;&#x7EA6;&#x6302;&#x53F7;&#x9879;&#x76EE;&#x7684;&#x4E8C;&#x671F;&#xFF0C;&#x548C;&#x4E00;&#x671F;&#x76F8;&#x6BD4;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x529F;&#x80FD;&#x548C;&#x9700;&#x6C42;&#x589E;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x96BE;&#x5EA6;&#x4E5F;&#x7A0D;&#x5FAE;&#x63D0;&#x5347;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x6253;&#x7B97;&#x7EE7;&#x7EED;&#x7528;react + webpack &#x5F00;&#x53D1;&#xFF0C;&#x56E0;&#x4E3A;&#x6302;&#x53F7;&#x7684;&#x4E00;&#x671F;&#x6211;&#x5C31;&#x662F;&#x7528;react + webpack&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x4E8C;&#x671F;&#x7528;&#x540C;&#x6837;&#x7684;&#x6846;&#x67B6;&#x548C;&#x6280;&#x672F;&#x80FD;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x8BA9;&#x6211;&#x5BF9;react&#x6846;&#x67B6;&#x66F4;&#x6DF1;&#x4E00;&#x6B65;&#x7684;&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x3002;&#x6211;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x89C4;&#x5212;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x505A;&#x597D;&#x5145;&#x5206;&#x7684;&#x51C6;&#x5907;&#xFF0C;&#x4EE5;&#x4FBF;&#x540E;&#x671F;&#x80FD;&#x591F;&#x987A;&#x5229;&#x5F00;&#x53D1;&#x5B8C;&#x6210;&#x3002;<br>    &#x4E09;&#x3001;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x8BA1;&#x5212;<br>    &#x8FD1;&#x4E09;&#x4E2A;&#x6708;&#x4EE5;&#x6765;&#x5728;&#x9886;&#x5BFC;&#x548C;&#x5404;&#x4F4D;&#x540C;&#x4E8B;&#x7684;&#x6307;&#x5BFC;&#x548C;&#x5E2E;&#x52A9;&#x4E0B;&#xFF0C;&#x4F7F;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x80FD;&#x591F;&#x987A;&#x5229;&#x8FDB;&#x884C;&#xFF0C;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x4E5F;&#x53D1;&#x73B0;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#x63D0;&#x5347;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x5177;&#x4F53;&#x5982;&#x4E0B;&#xFF1A;<br>    (1) &#x524D;&#x7AEF;&#x6280;&#x672F;&#x77AC;&#x606F;&#x4E07;&#x53D8;&#xFF0C;&#x575A;&#x6301;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x7528;&#x4E8E;&#x5B9E;&#x8DF5;&#x3002;<br>    (2) &#x5BF9;&#x5DE5;&#x4F5C;&#x7684;&#x9884;&#x89C1;&#x6027;&#x548C;&#x521B;&#x9020;&#x6027;&#x4E0D;&#x591F;&#xFF0C;&#x5728;&#x4ECA;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x4E25;&#x683C;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#xFF0C;&#x865A;&#x5FC3;&#x5411;&#x5176;&#x4ED6;&#x540C;&#x4E8B;&#x5B66;&#x4E60;&#xFF0C;&#x4E89;&#x53D6;&#x5728;&#x5404;&#x65B9;&#x9762;&#x53D6;&#x5F97;&#x66F4;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x3002;<br>    &#x65F6;&#x95F4;&#x8FC7;&#x5F97;&#x5F88;&#x5FEB;&#xFF0C;&#x6211;&#x5DF2;&#x5230;&#x516C;&#x53F8;&#x5DE5;&#x4F5C;&#x8FD1;&#x4E09;&#x4E2A;&#x6708;&#x3002;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x516C;&#x53F8;&#x9886;&#x5BFC;&#x5BF9;&#x6211;&#x7684;&#x4FE1;&#x4EFB;&#xFF0C;&#x7ED9;&#x4E88;&#x6211;&#x4F53;&#x73B0;&#x81EA;&#x6211;&#x3001;&#x63D0;&#x9AD8;&#x81EA;&#x6211;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x8FD9;&#x8FD1;&#x4E09;&#x4E2A;&#x6708;&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF0C;&#x4F7F;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x80FD;&#x529B;&#x5F97;&#x5230;&#x4E86;&#x5927;&#x5E45;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#x3002;<br>    &#x5728;&#x5BF9;&#x8BD5;&#x7528;&#x671F;&#x7684;&#x5DE5;&#x4F5C;&#x60C5;&#x51B5;&#x53CA;&#x5FC3;&#x5F97;&#x4F53;&#x4F1A;&#x505A;&#x4E00;&#x6C47;&#x62A5;&#x540E;&#xFF0C;&#x6211;&#x6B63;&#x5F0F;&#x5411;&#x516C;&#x53F8;&#x9886;&#x5BFC;&#x63D0;&#x51FA;&#x8F6C;&#x6B63;&#x7533;&#x8BF7;&#x3002;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x6709;&#x5E78;&#x6210;&#x4E3A;&#x516C;&#x53F8;&#x7684;&#x6B63;&#x5F0F;&#x4E00;&#x5458;&#xFF0C;&#x505A;&#x4E00;&#x540D;&#x771F;&#x6B63;&#x7684;&#x4EAC;&#x4E1C;&#x4EBA;&#x3002;&#x8BF7;&#x5404;&#x9886;&#x5BFC;&#x4E88;&#x4EE5;&#x6279;&#x51C6;&#xFF0C;&#x8C22;&#x8C22;&#xFF01;<br>                                                                                                                        &#x7533;&#x8BF7;&#x4EBA;&#xFF1A;&#x5218;&#x771F;&#x5EF6;<br>                                                                                                                        &#x65E5;&#x671F;&#xFF1A;2017&#x5E74;11&#x6708;20&#x65E5;</p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2019-03-12T02:30:43.000Z" itemprop="datePublished">2019-03-12</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2019/03/12/nodejs/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    node.js
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a class="ui tiny button disabled">下一篇<i class="angle right icon"></i></a>

                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">刘真延</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
